<?php
/*$a=5;//number
$b="5";//string
if($a==$b)//перевір тільки значення якщо різні типи то відбувається приведенн до старшого типу
{
    echo "змінні рівні";
}
echo"<hr>";
if($a===$b)//строге порівняння при якому перевір значення і тип значення
{
    echo"змінні рівні";
}
else{
    echo "змінні не рівні";
}
*/
$a=[1,2,3,4,5];
$b='Hello world';
$a[]=$b;//підставляєио в кінець масива рядок в
//print_r($a);
$b=array();//рядок в робимо масивом
for($i=0;$i<count($a)-1;$i++)//перебііраємо масив без остннього елемента в якому зберігається рядок в
{
    $b[$i]=$a[$i];// копіюємо тільки цифри з масиву в масив
}
$a=$a[count($a)-1];//отримуємо хначення останнього елемента масиву і записуєо його в змінну а не як в масив а як в обичну змінну
print_r($b);
echo $a;
?>